Revit 2027 API
DividedSurface.GetGridNodeUV Method
Get the position of a grid node in UV coordinates in the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public UV GetGridNodeUV(
	GridNode gridNode
)
Public Function GetGridNodeUV (
	gridNode As GridNode
) As UV
public:
UV^ GetGridNodeUV(
	GridNode gridNode
)
member GetGridNodeUV :
        gridNode : GridNode -> UV
Parameters
gridNode GridNode
Return Value
UV
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when the grid node indexes are outside the range [ 0, NumberOfUGridlines - 1 ], [ 0, NumberOfVGridlines - 1 ].
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace